olikraus/stm32g031/motor_test_8/motor_test_8.c
/* 

  DC motor test with the STM32G031

  Copyright (c) 2023, olikraus@gmail.com
  All rights reserved.

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
     list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice,
     this list of conditions and the following disclaimer in the documentation
     and/or other materials provided with the distribution.

  3. Neither the name of the copyright holder nor the names of its
     contributors may be used to endorse or promote products derived from
     this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.  


  Default clock is HSI16 (16 MHz)
    
  Ensure that -DUSER_VECT_TAB_ADDRESS is set during compilation, otherwise
  interrupts will not work after the "go" commant of the flashware USART upload.
  
  Problem is, that SCB->VTOR doesn't point to FLASH_BASE, so manually
  assigning SCB->VTOR = FLASH_BASE;	will also fix this.

  If -DUSER_VECT_TAB_ADDRESS is defined, then the SCB->VTOR is set in
  SystemInit(void) which is called by the reset handler (.s file).

  This code was tested with my STM32G031 TSOP20 board
  
  OLED
    SCL @PA2
    SDA @PA1

  Varpot:
    PA4 (ADC IN4)
  
  LEDs (future H-Bridge inputs) at 
    A13
    B9
  
  The code will show the value (12 bit) of the varpot on the OLED screen.

TIM17 could trigger TIM1, which in turn could trigger ADC
  --> Chapter 21.3.26 TIM1 Slave mode: Combined reset + trigger mode

input start trigger for ADC EXTSEL[2:0] in CFGR1
TRG0    TIM1_TRGO2  000
TRG1    TIM1_CC4    001
TRG2    TIM2_TRGO   010
TRG3    TIM3_TRGO   011
TRG4    TIM15_TRGO  100
TRG5    TIM6_TRGO   101
TRG6    TIM4_TRGO   110
TRG7    EXTI11      111


DRV8871:
IN1     IN2     OUT1    OUT2            DESCRIPTION
0         0         High-Z  High-Z           Coast; H-bridge disabled to High-Z (sleep entered after 1 ms)
0         1         L           H                   Reverse (Current OUT2 → OUT1)
1         0         H           L                   Forward (Current OUT1 → OUT2)
1         1         L           L                    Brake; low-side slow decay

--> no measurement possible in Coast and Break mode

https://electronics.stackexchange.com/questions/674622/braking-vs-coasting-during-the-pwm-off-state-of-a-h-bridge

Coast vs Break
Coast: High voltage and probably High current back --> more stressful for the FETs
Break: Coil current can continue as usual 

*/

#include "stm32g0xx.h"
#include "delay.h"
#include "sys_util.h"
#include "adc.h"
#include "u8g2.h"
#include <string.h>     /* memcpy */

uint8_t u8x8_gpio_and_delay_stm32g0(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr);
/*===========================================*/
/* global variables */
volatile uint16_t varpot = 0; // PA4, IN4, updated via DMA
volatile uint16_t refint = 0;  // bandgap reference 1212mV, updated via DMA

volatile uint32_t adc_motor_ticks = 0;
volatile uint32_t adc_varpot_ticks = 0;
volatile uint32_t adc_refint_ticks = 0;
volatile uint32_t update_adc_ticks_start = 0;
volatile uint32_t *update_adc_ticks_address = NULL;     // the addres of the global variable, which should be updated
volatile uint32_t tim17_peroidic_ticks = 0;                     // number of ticks between calls to TIM17 irq (5000Hz --> 12200 ticks)
volatile uint32_t tim17_peroidic_ticks_start = 0;               // start value for calculation of tim17_peroidic_ticks

/* the below tim17 state machine has mutliple substate machines, the follow variable will request one of them */

#define TIM17_REQ_NONE 0
#define TIM17_REQ_DRIVE 1
#define TIM17_REQ_IS_TRANSITION 2               // train between track section?
#define TIM17_REQ_IS_OCCUPIED 3                 // track section occopied by train?
volatile uint16_t tim17_req = TIM17_REQ_NONE;

/* defines for the TIM17 irq handler state machine */
#define TIM17_IRQ_STATE_IDLE 0

/* forward/backward drive */
#define TIM17_IRQ_STATE_DRIVE_START_ADC         10
#define TIM17_IRQ_STATE_DRIVE_WAIT_ADC          11
#define TIM17_IRQ_STATE_DRIVE_GET_SUPPLY                12
#define TIM17_IRQ_STATE_DRIVE_GET_VARPOT               13

/* is in transition check */
#define TIM17_IRQ_STATE_IS_TRANSITION_START_ADC         20
#define TIM17_IRQ_STATE_IS_TRANSITION_WAIT_ADC         21

/* is occupied / is dc motor connected check */
#define TIM17_IRQ_STATE_IS_OCCUPIED_START_ADC         30
#define TIM17_IRQ_STATE_IS_OCCUPIED_WAIT_ADC         31
#define TIM17_IRQ_STATE_IS_OCCUPIED_WAIT2_ADC         32


volatile uint16_t tim17_irq_state = TIM17_IRQ_STATE_IDLE;       // state variable for tim17 irq handler
volatile uint16_t tim17_irq_cnt = 0;                                    // just a counter how often tim17 irq handler is called

volatile uint16_t tim17_drive_current = 0;                              // 

volatile uint16_t tim17_is_transition = 0;                      // 0: not in transtion, 1: in transtion, 2: calculation ongoing


volatile uint16_t tim17_is_occupied = 0;                      // 0: motor not connected, 1: connected, 2: calculation ongoing

/*===========================================*/
/* Utility Procedures */

