olikraus/stm32g031/motor_test_8/motor_test_8.c
  TIM17->DIER = 0;
  TIM17->DIER |= TIM_DIER_CC1IE;  // enable irq if counter reaches CCR1 value
  //TIM17->DIER |= TIM_DIER_UIE; // enable irq if counter is reseted to 0 (ARR value reached)
  
  tim17_peroidic_ticks_start = SysTick->VAL;            // at least get some suitable starting point
  NVIC_SetPriority(TIM17_IRQn, 0);      // level 0 is highest prio (PM0223)
  NVIC_EnableIRQ(TIM17_IRQn);

  /* CR1 configuration */
  TIM17->CR1 = TIM_CR1_ARPE  // buffered output for ARR register
                        | TIM_CR1_CEN   // enable counter
                        ;



  /*=== TIM1 ===*/
  /* TIM1 will be triggered by TIM17 to generate the ADC start event (which can't be done by TIM17 */
  
  /* use default values for control reg. (up counting) */
  /* this will use the reset event for TRGO0 and TRGO2 output trigger lines */
  TIM1->CR1 = 0;
  TIM1->CR2 = 0;                // Reset event set to TRGO2 (for ADC)

  TIM1->CR1 |= TIM_CR1_OPM;             // one pulse mode

  TIM1->SMCR = 0;       // clear the slave mode control registier
  //TIM1->SMCR |= TIM_SMCR_SMS_0; 
  //TIM1->SMCR |= TIM_SMCR_SMS_1; 
  //TIM1->SMCR |= TIM_SMCR_SMS_2; 
  TIM1->SMCR |= TIM_SMCR_SMS_3; // select slave mode: Combined reset + trigger mode on rising edge of trigger input
  
  TIM1->SMCR |= TIM_SMCR_TS_0 | TIM_SMCR_TS_1; //ITR3: TIM17 OC1 as Trigger Source 

  TIM1->PSC = 50000;  // prescaler
  TIM1->CNT = 0;
  TIM1->ARR = 0xfff0;
  
  //TIM1->CR1 |= TIM_CR1_CEN;             // enable TIM1: not required, will by done by trigger event
  


  /*=== TIM16 ===*/
  
  /* Force TIM16 output to high so that TIM17 output is passed through IR Interface */
  
  TIM16->CR1 = 0;               // all default values
  TIM16->CR2 = 0;               // all default values
  TIM16->CCER = TIM_CCER_CC1E;              // default values, output mode, output enable
  TIM16->BDTR = TIM_BDTR_MOE;                   // main output enable (REQUIRED!)
  TIM16->CCMR1 = 5<<TIM_CCMR1_OC1M_Pos;        // force high
}




/*
  read multiple ADC values
*/
void adc_get_values_with_dma(volatile uint16_t *adr, uint16_t cnt, uint8_t ch)
{
  
  /* check for ongoing conversion */
  
  if ( ADC1->CR & ADC_CR_ADSTART )  // is any conversion ongoing?
  {
    ADC1->CR |= ADC_CR_ADSTP;   // if so, then stop the conversion
    while( ADC1->CR & ADC_CR_ADSTP )      // wait until stop is executed
        ;
  }
  
  /* DMA config inside ADC1 */
  
  ADC1->CFGR1 &= ~ADC_CFGR1_DMACFG;              // disable DMA circular mode --> one shot mode
  ADC1->CFGR1 |= ADC_CFGR1_DMAEN | ADC_CFGR1_CONT;              // enable DMA, enable continues mode (because we need to read 'cnt' values
  
  /* Select requested channel */
  
  ADC1->CHSELR = 1<<ch; 				

  /* configure DMA, DMAMUX is already configured */
  
  DMA1_Channel1->CCR = 0;       // clear DMA channel register
  
  DMA1_Channel1->CNDTR = cnt;                                        /* buffer size, number of ADC scans --> array length */
  DMA1_Channel1->CPAR = (uint32_t)&(ADC1->DR);                     /* source value */
  DMA1_Channel1->CMAR = (uint32_t)adr;                   /* destination memory */
  DMA1_Channel1->CCR |= DMA_CCR_PL		/* highest prio */   
                                        | DMA_CCR_TCIE                /* enable DMA and DMA completion IRQ */
                                        | DMA_CCR_MINC		/* increment memory */   
                                        | DMA_CCR_MSIZE_0		/* 01: 16 Bit access */   
                                        | DMA_CCR_PSIZE_0		/* 01: 16 Bit access */   
                                        | DMA_CCR_EN;                   /* enable DMA */


  ADC1->CR |= ADC_CR_ADSTART; /* start the ADC conversion */

  //delay_micro_seconds(cnt);     // test delay, conversion time is actually lesser than one 1us per sample
}


/*===========================================*/







/*
  duty:
    0 .. (1<<TIM17_BIT_CNT)-1

  DRV8871:
  IN1     IN2     OUT1    OUT2            DESCRIPTION
  0         0         High-Z  High-Z           Coast; H-bridge disabled to High-Z (sleep entered after 1 ms)
  0         1         L           H                   Reverse (Current OUT2 → OUT1)
  1         0         H           L                   Forward (Current OUT1 → OUT2)
  1         1         L           L                    Brake; low-side slow decay

The GPIO Mode register has two bits:
  00: Input mode
  01: General purpose output mode
  10: Alternate function mode
  11: Analog mode (reset state)
  
  Code below will switch between output mode (constant 0 or 1) and alternate function mode (TIM17 PWM)

*/

/* disconnect both dc motor lines --> Hi-Z: coast */
void tim17_motor_coast(void)
{
    GPIOB->MODER &= ~GPIO_MODER_MODE9;	/* clear mode */
    GPIOB->MODER |= GPIO_MODER_MODE9_0;	/* output mode */    
    GPIOB->BSRR = GPIO_BSRR_BR9;                      /* clear bit */
  
    GPIOA->MODER &= ~GPIO_MODER_MODE13;	/* clear mode */
    GPIOA->MODER |= GPIO_MODER_MODE13_0;	/* output mode */
    GPIOA->BSRR = GPIO_BSRR_BR13;                    /* clear bit */
}

/* connect both dc motor lines to GND: break */
void tim17_motor_break(void)
{
    GPIOB->MODER &= ~GPIO_MODER_MODE9;	/* clear mode */
    GPIOB->MODER |= GPIO_MODER_MODE9_0;	/* output mode */    
    GPIOB->BSRR = GPIO_BSRR_BS9;                      /* set bit */
  
    GPIOA->MODER &= ~GPIO_MODER_MODE13;	/* clear mode */
    GPIOA->MODER |= GPIO_MODER_MODE13_0;	/* output mode */
    GPIOA->BSRR = GPIO_BSRR_BS13;                    /* set bit */
}

void tim17_motor_pwm_backward(void)
{
    GPIOA->MODER &= ~GPIO_MODER_MODE13;	/* clear mode */
    GPIOA->MODER |= GPIO_MODER_MODE13_1;	/* Alternate Function mode */
    
    GPIOB->MODER &= ~GPIO_MODER_MODE9;	/* clear mode */
    GPIOB->MODER |= GPIO_MODER_MODE9_0;	/* output mode */    
    GPIOB->BSRR = GPIO_BSRR_BS9;
}

void tim17_motor_pwm_forward(void)
{
    GPIOA->MODER &= ~GPIO_MODER_MODE13;	/* clear mode */
    GPIOA->MODER |= GPIO_MODER_MODE13_0;	/* output mode */
    GPIOA->BSRR = GPIO_BSRR_BS13;
    
    GPIOB->MODER &= ~GPIO_MODER_MODE9;	/* clear mode */
    GPIOB->MODER |= GPIO_MODER_MODE9_1;	/* Alternate Function mode */
}


