olikraus/stm32g031/motor_test_8/motor_test_8.c
void tim17_set_duty(uint16_t duty, uint16_t is_backward)
{
  TIM17->CCR1 = ((1<<TIM17_BIT_CNT)-1) - duty;
  /* 
    the idea is to switch between the TIM17 output and the GPIO output 
    GPIO output is always 1 (assigned during init), so the below code will swap IN1 and IN2 connection.
  
    The TIM17 output will be either connected to IN1 or IN2 whole the constant 1 is applied to the other INx
    As a result, the DRV8871 H-Bridge toggles between forward/backward and break mode  
  */
  if ( is_backward )
  {
    tim17_motor_pwm_backward();
  }
  else
  {
    tim17_motor_pwm_forward();
  }
  tim17_req = TIM17_REQ_DRIVE;
}

void tim17_set_duty_by_varpot(void)
{
    uint16_t adc = varpot;
    uint16_t inv = adc >= (1<<11)?1:0;
    if ( inv )
      adc = adc - (1<<11);
    else
      adc = (1<<11) - 1 - adc;
      
    tim17_set_duty(adc, inv);
}

/*
  start to figure out, whether the train is in transition from one section to the next section.
  For this, we put the driver into break mode, this means tim is actually disabled, but will still generate IRQ requests

  
  The result is stored in the global variable 
    tim17_is_transition
  After calling this function, the value 2 will be assigned to "tim17_is_transition",
  then, after some time, the value will be changed to 0 or 1 depending on the result.
*/
void tim17_start_is_transition()
{
  tim17_is_transition = 2;
  tim17_motor_break();
  tim17_req = TIM17_REQ_IS_TRANSITION;
}

void tim17_start_is_occupied()
{
  uint16_t duty = 600;           // use some small value, TODO: Create a global config variable for this
  tim17_is_occupied = 2;
  TIM17->CCR1 = ((1<<TIM17_BIT_CNT)-1) - duty; 
  tim17_motor_pwm_forward();            // forward or backward doesn't matter for the connection test
  tim17_req = TIM17_REQ_IS_OCCUPIED;
}


/*===========================================*/
#define MOTOR_DISCONNECTED 0
#define MOTOR_IS_TRANSITION_WAIT 1
#define MOTOR_IS_OCCUPIED_WAIT 2
#define MOTOR_CONNECTED 3
volatile uint16_t motor_state = MOTOR_DISCONNECTED;

void motor_state_next(void)
{
  switch(motor_state)
  {
    case MOTOR_DISCONNECTED:
      tim17_start_is_transition();
      motor_state = MOTOR_IS_TRANSITION_WAIT;
      break;
    case MOTOR_IS_TRANSITION_WAIT:
      if ( tim17_is_transition == 0 )           // not in transition, then start connected test
      {
        tim17_start_is_occupied();
        motor_state = MOTOR_IS_OCCUPIED_WAIT;
      }
      else  if ( tim17_is_transition == 1 )  // in transition... restart the test... wait until transition is done
      {
        tim17_start_is_transition();
      }
      break;
    case MOTOR_IS_OCCUPIED_WAIT:
      if ( tim17_is_occupied == 0 )           // not connected..
      {
        motor_state = MOTOR_DISCONNECTED;
      }
      else if ( tim17_is_occupied == 1 )
      { 
        motor_state = MOTOR_CONNECTED;
        tim17_set_duty_by_varpot();
      }
      break;
    case MOTOR_CONNECTED:
      tim17_set_duty_by_varpot();
      if ( tim17_drive_current < 2 )  // TODO: Add a global threshold value
      {
        motor_state = MOTOR_DISCONNECTED;
        tim17_motor_coast();
      }
      break;
  }
}


/*===========================================*/

#define ADC_RAW_SAMPLE_CNT 128
uint16_t adc_raw_sample_array[ADC_RAW_SAMPLE_CNT] __attribute__ ((aligned (4)));
uint16_t adc_copy_sample_array[ADC_RAW_SAMPLE_CNT] __attribute__ ((aligned (4)));


uint16_t dma_busy_cnt = 0;
uint16_t varpot_skip_cnt = 0;
uint16_t varpot_skip_total = 200;


void tim17_handle_request(void)
{
  switch(tim17_req)
  {
    case TIM17_REQ_DRIVE:
      tim17_irq_state = TIM17_IRQ_STATE_DRIVE_START_ADC;
      break;
    case TIM17_REQ_IS_TRANSITION:
      tim17_irq_state = TIM17_IRQ_STATE_IS_TRANSITION_START_ADC;
      break;
    case TIM17_REQ_IS_OCCUPIED:
      tim17_irq_state = TIM17_IRQ_STATE_IS_OCCUPIED_START_ADC;
      break;
  }
  tim17_req = TIM17_REQ_NONE;
}


void __attribute__ ((interrupt, used)) TIM17_IRQHandler(void)
{
  uint32_t sum;
  uint16_t i; 
  tim17_peroidic_ticks = getProcessorClockDelta(tim17_peroidic_ticks_start);
  tim17_peroidic_ticks_start = SysTick->VAL;
  ++tim17_irq_cnt;

  switch( tim17_irq_state )
  {
    
    /* === IDLE === */
    
    case TIM17_IRQ_STATE_IDLE:
        if ( varpot_skip_cnt == 0 )
        {
          adc_get_values_with_dma(&varpot, 1, 4);               // read var pot value
          update_adc_ticks_start = SysTick->VAL;
          update_adc_ticks_address = &adc_varpot_ticks;
          varpot_skip_cnt = varpot_skip_total;
        }
        else
        {
          varpot_skip_cnt--;
        }
        /* stay in IDLE state */
        tim17_handle_request();           // override and jump to a different sub state machine if required
        break;
        
    /* === DRIVE === */
        
    case TIM17_IRQ_STATE_DRIVE_START_ADC:
      adc_get_values_with_dma(adc_raw_sample_array, ADC_RAW_SAMPLE_CNT, 3);               // this will just start the sampling process
      update_adc_ticks_start = SysTick->VAL;
      update_adc_ticks_address = &adc_motor_ticks; 
      dma_busy_cnt = 0;
      tim17_irq_state = TIM17_IRQ_STATE_DRIVE_WAIT_ADC;
      break;
    case TIM17_IRQ_STATE_DRIVE_WAIT_ADC:
      if ( DMA1_Channel1->CNDTR == 0 )
      {
        memcpy(adc_copy_sample_array, adc_raw_sample_array, ADC_RAW_SAMPLE_CNT*sizeof(uint16_t));
        
        sum = 0;
        for( i = 0; i < ADC_RAW_SAMPLE_CNT; i++ )
          sum += (adc_raw_sample_array[i]>>4);
        tim17_drive_current = sum;
        if ( sum == 0 )
          tim17_irq_state = TIM17_IRQ_STATE_IDLE;
        else 
          tim17_irq_state = TIM17_IRQ_STATE_DRIVE_GET_SUPPLY;
      }
      else
      {
        dma_busy_cnt++;
        if ( dma_busy_cnt > 16 )
        {
          tim17_irq_state = TIM17_IRQ_STATE_IDLE;
        }
      }
      break;
    case TIM17_IRQ_STATE_DRIVE_GET_SUPPLY:
      adc_get_values_with_dma(&refint, 1, 13);               // read bandgap value
      update_adc_ticks_start = SysTick->VAL;
      update_adc_ticks_address = &adc_refint_ticks; 
      tim17_irq_state = TIM17_IRQ_STATE_DRIVE_GET_VARPOT;
      break;
    case TIM17_IRQ_STATE_DRIVE_GET_VARPOT:
      if ( varpot_skip_cnt == 0 )
      {
        adc_get_values_with_dma(&varpot, 1, 4);               // read var pot value
        update_adc_ticks_start = SysTick->VAL;
        update_adc_ticks_address = &adc_varpot_ticks;
        varpot_skip_cnt = varpot_skip_total;
      }
      else
      {
        varpot_skip_cnt--;
      }
      tim17_irq_state = TIM17_IRQ_STATE_DRIVE_START_ADC;
      tim17_handle_request();           // override and jump to a different sub state machine if required
      break;

    /* === IS TRANSITION === */
      
    case TIM17_IRQ_STATE_IS_TRANSITION_START_ADC:
      /* "is transition" monitoring is almost the same as the drive states from above */
      adc_get_values_with_dma(adc_raw_sample_array, ADC_RAW_SAMPLE_CNT, 3);               // this will just start the sampling process
      update_adc_ticks_start = SysTick->VAL;
      update_adc_ticks_address = &adc_motor_ticks; 
      dma_busy_cnt = 0;
      tim17_irq_state = TIM17_IRQ_STATE_IS_TRANSITION_WAIT_ADC;
      break;
    case TIM17_IRQ_STATE_IS_TRANSITION_WAIT_ADC:
      if ( DMA1_Channel1->CNDTR == 0 )
      {
        sum = 0;
        for( i = 0; i < ADC_RAW_SAMPLE_CNT; i++ )
          sum += (adc_raw_sample_array[i]>>4);
        tim17_drive_current = sum;

        if ( sum > 0 )
          memcpy(adc_copy_sample_array, adc_raw_sample_array, ADC_RAW_SAMPLE_CNT*sizeof(uint16_t));
        
