olikraus/stm32g031/motor_test_8/motor_test_8.c
        tim17_is_transition = (sum >= 2) ? 1 : 0;               // TODO: Create a global threshold value, warning: "sum" is NOT divided by ADC_RAW_SAMPLE_CNT
        tim17_motor_coast();            // disconnect DC Motor
        tim17_irq_state = TIM17_IRQ_STATE_IDLE;
      }
      else
      {
        dma_busy_cnt++;
        if ( dma_busy_cnt > 16 )
        {
          tim17_is_transition = 0;      // error state, report as no transition
          tim17_irq_state = TIM17_IRQ_STATE_IDLE;
        }
      }
      break;

    /* === IS OCCUPIED / IS DC MOTOR CONNECTED === */
      
    case TIM17_IRQ_STATE_IS_OCCUPIED_START_ADC:
      /* "is transition" monitoring is almost the same as the drive states from above */
      tim17_irq_state = TIM17_IRQ_STATE_IS_OCCUPIED_WAIT_ADC;
      dma_busy_cnt = 3; // used as delay counter
      break;
    case TIM17_IRQ_STATE_IS_OCCUPIED_WAIT_ADC:
      if ( dma_busy_cnt > 0 )
      {
        dma_busy_cnt--;
        break;
      }
      adc_get_values_with_dma(adc_raw_sample_array, ADC_RAW_SAMPLE_CNT, 3);               // this will just start the sampling process
      update_adc_ticks_start = SysTick->VAL;
      update_adc_ticks_address = &adc_motor_ticks; 
      dma_busy_cnt = 0;
      tim17_irq_state = TIM17_IRQ_STATE_IS_OCCUPIED_WAIT2_ADC;
      break;
    case TIM17_IRQ_STATE_IS_OCCUPIED_WAIT2_ADC:
      if ( DMA1_Channel1->CNDTR == 0 )
      {
        sum = 0;
        for( i = 0; i < ADC_RAW_SAMPLE_CNT; i++ )
          sum += (adc_raw_sample_array[i]>>4);
        tim17_drive_current = sum;

        if ( sum > 0 )
          memcpy(adc_copy_sample_array, adc_raw_sample_array, ADC_RAW_SAMPLE_CNT*sizeof(uint16_t));
        
        tim17_is_occupied = (sum >= 2) ? 1 : 0;         // TODO: Create a global threshold value
        //tim17_is_occupied = 1;
        tim17_motor_coast();            // disconnect DC Motor
        tim17_irq_state = TIM17_IRQ_STATE_IDLE;
      }
      else
      {
        dma_busy_cnt++;
        if ( dma_busy_cnt > 16 )
        {
          tim17_is_occupied = 1;      // error state, report as no transition
          tim17_irq_state = TIM17_IRQ_STATE_IDLE;
        }
      }
      break;
    default:
      tim17_irq_state = TIM17_IRQ_STATE_IDLE;
      break;
  }
  
  TIM17->SR = 0;        // status must be cleared otherwise another IRQ is generated
  
}

/*
  DMA1_Channel1_IRQHandler is only used for completion of ADC transfers
*/
uint16_t dma_irq_cnt = 0;
void __attribute__ ((interrupt, used)) DMA1_Channel1_IRQHandler(void)
{
  if ( update_adc_ticks_address != NULL )
  {
    *update_adc_ticks_address = getProcessorClockDelta(update_adc_ticks_start);
    update_adc_ticks_address = NULL;
  }
  
  
  dma_irq_cnt++;
  DMA1->IFCR = DMA_IFCR_CTCIF1;       // clear the transfer complete IRQ
  // TODO: DMA is only used by ADC, so we could stop the ADC after DMA completion
  //ADC1->CR |= ADC_CR_ADSTP
}

/*===========================================*/

volatile unsigned long adc_irq_cnt = 0;


void adc_enable_interrupt(void)
{
  ADC1->ISR |= ADC_ISR_EOS;             /* clear the end of sequence bit */
  NVIC_SetPriority( ADC1_IRQn, 2);      // 3: lowest priority, 0: highest priority
  NVIC_EnableIRQ(ADC1_IRQn);
  ADC1->IER |= ADC_IER_EOCIE;             /* enable end of sequence interrupt */
} 

void __attribute__ ((interrupt, used)) ADC1_IRQHandler(void)
{
  ADC1->ISR |= ADC_ISR_EOS;             /* clear the end of sequence bit */
  adc_irq_cnt++;
}


/*===========================================*/

volatile unsigned long SysTickCount = 0;


void __attribute__ ((interrupt, used)) SysTick_Handler(void)
{
  SysTickCount++;  
  
  // PA3 is the current senser of the dc motor
  //if ( SysTickCount & 1 )
  //  GPIOA->BSRR = GPIO_BSRR_BS3;		/* atomic set PA3 */
  //else
  //  GPIOA->BSRR = GPIO_BSRR_BR3;		/* atomic clr PA3 */
}


/*===========================================*/

u8g2_t u8g2;

void drawDisplay(void)
{
  uint16_t v;
  uint16_t i;
  char *motor_state_str = "";
  //uint16_t motor_current = adc_get_value(3); // PA3, IN3 
  //varpot = adc_get_value(4); // PA4, IN4 
  //refint = adc_get_value(13);  // bandgap reference 1212mV
  uint16_t supply = (4095UL*1212UL)/refint;

  if ( motor_state == MOTOR_DISCONNECTED )
    motor_state_str = "D";
  else if ( motor_state == MOTOR_CONNECTED )
    motor_state_str = "C";
  else if ( motor_state == MOTOR_IS_TRANSITION_WAIT )
    motor_state_str = "T";
  else if ( motor_state == MOTOR_IS_OCCUPIED_WAIT )
    motor_state_str = "O";
  else
    motor_state_str = "-";

  

  u8g2_SetFont(&u8g2, u8g2_font_5x7_tr);
  u8g2_ClearBuffer(&u8g2);
  //u8g2_DrawStr(&u8g2, 0,12, "STM32G031");
  //u8g2_DrawStr(&u8g2, 70,12, u8x8_u8toa(SystemCoreClock/1000000, 2));
  //u8g2_DrawStr(&u8g2, 85,12, "MHz");
  
  u8g2_DrawStr(&u8g2, 0,8, "mV");
  u8g2_DrawStr(&u8g2, 25,8, "Pot");
  u8g2_DrawStr(&u8g2, 50,8, "Duty");
  u8g2_DrawStr(&u8g2, 75,8, "Current");

  u8g2_DrawStr(&u8g2, 0,16, u8x8_u16toa(supply, 4));
  u8g2_DrawStr(&u8g2, 25,16, u8x8_u16toa(varpot, 4));
  u8g2_DrawStr(&u8g2, 50,16, u8x8_u16toa(TIM17->CCR1, 4));
  //u8g2_DrawStr(&u8g2, 75,16, u8x8_u16toa(motor_current, 4));

  u8g2_DrawStr(&u8g2, 75,16, u8x8_u16toa(tim17_drive_current, 5));


  //u8g2_DrawStr(&u8g2, 0,24, "TIM17 irq cnt:");
  //u8g2_DrawStr(&u8g2, 70,24, u8x8_u16toa(tim17_irq_cnt, 5));

  //u8g2_DrawStr(&u8g2, 0,24, "ADC busy:");
  //u8g2_DrawStr(&u8g2, 70,24, u8x8_u16toa(dma_busy_cnt, 5));

  //u8g2_DrawStr(&u8g2, 0,24, "DMA irq cnt:");
  //u8g2_DrawStr(&u8g2, 70,24, u8x8_u16toa(dma_irq_cnt, 5));

  u8g2_DrawStr(&u8g2, 0,24, "Motor/T17:");
  u8g2_DrawStr(&u8g2, 70,24, u8x8_u16toa((uint16_t)adc_motor_ticks, 5));
  u8g2_DrawStr(&u8g2, 100,24, u8x8_u16toa((uint16_t)tim17_peroidic_ticks, 5));

  for( i = 0; i <  ADC_RAW_SAMPLE_CNT; i++ )
  {
    v = adc_copy_sample_array[i];
    v >>= 5;
    if ( v > 40 )
      v = 40;
    u8g2_DrawPixel( &u8g2, i, 63 - v );
  }

  u8g2_SetFont(&u8g2, u8g2_font_10x20_tr);
  u8g2_DrawStr(&u8g2, 116,15, motor_state_str);
  
  u8g2_SendBuffer(&u8g2);
}


void initDisplay(void)
{
  /* setup display */
  u8g2_Setup_ssd1306_i2c_128x64_noname_f(&u8g2, U8G2_R0, u8x8_byte_sw_i2c, u8x8_gpio_and_delay_stm32g0);
  u8g2_InitDisplay(&u8g2);
  u8g2_SetPowerSave(&u8g2, 0);
}

int main()
{
  RCC->IOPENR |= RCC_IOPENR_GPIOAEN;		/* Enable clock for GPIO Port A */
  __NOP();
  __NOP();

  set_64mhz_sysclk(); 
  
  GPIOA->AFR[0] &= ~(0xf << (3*4));       /* clear alternative function */
  //GPIOA->AFR[0] = 0;       /* clear alternative function */
  
  // TODO: PA3 needs to be configured as analog in for the DC motor
  //GPIOA->MODER &= ~GPIO_MODER_MODE3;	/* clear mode for PA3 */
  //GPIOA->MODER |= GPIO_MODER_MODE3_0;	/* Output mode for PA3 */
  //GPIOA->OTYPER &= ~GPIO_OTYPER_OT3;	/* no Push/Pull for PA3 */
  //GPIOA->OSPEEDR &= ~GPIO_OSPEEDR_OSPEED3;	/* low speed for PA3 */
  //GPIOA->PUPDR &= ~GPIO_PUPDR_PUPD3;	/* no pullup/pulldown for PA3 */
  //GPIOA->BSRR = GPIO_BSRR_BR3;		/* atomic clr PA3 */
  
  SysTick->LOAD = 16000*500 - 1;        // Blink with 4 Hz 
  NVIC_SetPriority( SysTick_IRQn, 3 );  // 3: lowest priority
  SysTick->VAL = 0;
  SysTick->CTRL = 7;   /* enable, generate interrupt (SysTick_Handler), do not divide by 2 */
  
  //adc_enable_interrupt();
  initDisplay();
  hardware_init(4000);
  
  NVIC_SetPriority(DMA1_Channel1_IRQn, 1);
  NVIC_EnableIRQ(DMA1_Channel1_IRQn);
  
  for(;;)
  {

    drawDisplay();
    
    motor_state_next();
    //tim17_set_duty_by_varpot();
    
    /*
    uint16_t adc = varpot;
    uint16_t inv = adc >= (1<<11)?1:0;
    if ( inv )
      adc = adc - (1<<11);
    else
      adc = (1<<11) - 1 - adc;
      
    tim17_set_duty(adc, inv);
    */
  }
}

